[
  {
    "Name": "Pyramids of Giza",
    "Description": "Comprising the Great Pyramid of Khufu, the Pyramid of Khafre, and the Pyramid of Menkaure, these monumental structures were built as tombs for Old Kingdom pharaohs. They stand as the last remaining wonder of the ancient world and exemplify the pinnacle of Egyptian pyramid construction techniques.",
    "Location": "giza",
    "Latitude": 29.9792,
    "Longitude": 31.1342,
    "Type Of Site": "pyramid",
    "Historical Era": "pharaonic",
    "Key Features": "['Pharaonic tombs', 'UNESCO World Heritage Site', 'Largest pyramid: Khufu']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "240 EGP (foreigners), 60 EGP (Egyptians)",
    "Text": "Name: Pyramids of Giza, Description: Comprising the Great Pyramid of Khufu, the Pyramid of Khafre, and the Pyramid of Menkaure, these monumental structures were built as tombs for Old Kingdom pharaohs. They stand as the last remaining wonder of the ancient world and exemplify the pinnacle of Egyptian pyramid construction techniques., Location: giza, Key Features: ['Pharaonic tombs', 'UNESCO World Heritage Site', 'Largest pyramid: Khufu'], Historical Era: pharaonic, Type: pyramid, Opening Hours: 08:00 - 17:00, Visit Duration: 2 - 3 hours, Entry Fee: 240 EGP (foreigners), 60 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Pyramids of Giza.jpeg'"
  },
  {
    "Name": "Great Sphinx of Giza",
    "Description": "Carved from a single piece of limestone, the Sphinx is thought to represent King Khafre and guards the Giza Plateau. Its enigmatic features and colossal size make it one of the world's most famous statues, reflecting ancient Egyptians' artistic mastery.",
    "Location": "giza",
    "Latitude": 29.9753,
    "Longitude": 31.1376,
    "Type Of Site": "monument",
    "Historical Era": "pharaonic",
    "Key Features": "['Symbol of royal power', 'Mythical guardian', 'Adjacent to Pyramids of Giza']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "Included with main Giza Plateau ticket",
    "Text": "Name: Great Sphinx of Giza, Description: Carved from a single piece of limestone, the Sphinx is thought to represent King Khafre and guards the Giza Plateau. Its enigmatic features and colossal size make it one of the world's most famous statues, reflecting ancient Egyptians' artistic mastery., Location: giza, Key Features: ['Symbol of royal power', 'Mythical guardian', 'Adjacent to Pyramids of Giza'], Historical Era: pharaonic, Type: monument, Opening Hours: 08:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: Included with main Giza Plateau ticket",
    "imageUrl": "'assets/images/'Great Sphinx of Giza.jpeg'"
  },
  {
    "Name": "Saqqara Necropolis",
    "Description": "Part of the ancient burial grounds of Memphis, Saqqara is best known for the Step Pyramid of Djoser, considered the world’s earliest large-scale stone monument. The site spans multiple dynasties and contains intricate tombs that offer insight into royal and noble funerary practices.",
    "Location": "giza",
    "Latitude": 29.871,
    "Longitude": 31.2165,
    "Type Of Site": "necropolis",
    "Historical Era": "pharaonic",
    "Key Features": "['Step Pyramid of Djoser', 'Funerary complex', 'Early pyramid-building techniques']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "200 EGP (foreigners), 40 EGP (Egyptians)",
    "Text": "Name: Saqqara Necropolis, Description: Part of the ancient burial grounds of Memphis, Saqqara is best known for the Step Pyramid of Djoser, considered the world’s earliest large-scale stone monument. The site spans multiple dynasties and contains intricate tombs that offer insight into royal and noble funerary practices., Location: giza, Key Features: ['Step Pyramid of Djoser', 'Funerary complex', 'Early pyramid-building techniques'], Historical Era: pharaonic, Type: necropolis, Opening Hours: 08:00 - 17:00, Visit Duration: 2 - 3 hours, Entry Fee: 200 EGP (foreigners), 40 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Saqqara Necropolis.jpeg'"
  },
  {
    "Name": "Dahshur Pyramids",
    "Description": "This archaeological area features the Bent Pyramid and the Red Pyramid, both commissioned by Pharaoh Sneferu. The Bent Pyramid illustrates an experimental phase of pyramid construction, while the Red Pyramid is the first successfully smooth-sided pyramid in history.",
    "Location": "giza",
    "Latitude": 29.8221,
    "Longitude": 31.2055,
    "Type Of Site": "pyramid",
    "Historical Era": "pharaonic",
    "Key Features": "['Bent Pyramid', 'Red Pyramid', 'Transition in pyramid architecture']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "200 EGP (foreigners), 40 EGP (Egyptians)",
    "Text": "Name: Dahshur Pyramids, Description: This archaeological area features the Bent Pyramid and the Red Pyramid, both commissioned by Pharaoh Sneferu. The Bent Pyramid illustrates an experimental phase of pyramid construction, while the Red Pyramid is the first successfully smooth-sided pyramid in history., Location: giza, Key Features: ['Bent Pyramid', 'Red Pyramid', 'Transition in pyramid architecture'], Historical Era: pharaonic, Type: pyramid, Opening Hours: 08:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 200 EGP (foreigners), 40 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Dahshur Pyramids.jpeg'"
  },
  {
    "Name": "Memphis",
    "Description": "Once the capital of Lower Egypt, Memphis was a religious and political center for centuries. Today, the open-air museum includes a colossal statue of Ramses II and other artifacts that illustrate the city’s former grandeur.",
    "Location": "giza",
    "Latitude": 29.8446,
    "Longitude": 31.2504,
    "Type Of Site": "archaeological site",
    "Historical Era": "pharaonic",
    "Key Features": "['Colossal Ramses II statue', 'Former capital', 'Artifacts from multiple eras']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "160 EGP (foreigners), 40 EGP (Egyptians)",
    "Text": "Name: Memphis, Description: Once the capital of Lower Egypt, Memphis was a religious and political center for centuries. Today, the open-air museum includes a colossal statue of Ramses II and other artifacts that illustrate the city’s former grandeur., Location: giza, Key Features: ['Colossal Ramses II statue', 'Former capital', 'Artifacts from multiple eras'], Historical Era: pharaonic, Type: archaeological site, Opening Hours: 08:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 160 EGP (foreigners), 40 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Memphis.jpeg'"
  },
  {
    "Name": "Egyptian Museum",
    "Description": "One of the world’s largest repositories of ancient Egyptian artifacts, including the famed treasures of Tutankhamun, royal mummies, and thousands of statues and relics. It provides a comprehensive overview of ancient Egyptian civilization spanning multiple dynasties.",
    "Location": "cairo",
    "Latitude": 30.0478,
    "Longitude": 31.2336,
    "Type Of Site": "museum",
    "Historical Era": "pharaonic",
    "Key Features": "['Tutankhamun collection', 'Royal mummies', 'Extensive ancient artifacts']",
    "Opening Hours": "09:00 - 19:00",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "200 EGP (foreigners), 60 EGP (Egyptians)",
    "Text": "Name: Egyptian Museum, Description: One of the world’s largest repositories of ancient Egyptian artifacts, including the famed treasures of Tutankhamun, royal mummies, and thousands of statues and relics. It provides a comprehensive overview of ancient Egyptian civilization spanning multiple dynasties., Location: cairo, Key Features: ['Tutankhamun collection', 'Royal mummies', 'Extensive ancient artifacts'], Historical Era: pharaonic, Type: museum, Opening Hours: 09:00 - 19:00, Visit Duration: 2 - 3 hours, Entry Fee: 200 EGP (foreigners), 60 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Egyptian Museum.jpeg'"
  },
  {
    "Name": "Museum of Islamic Art",
    "Description": "Housing an extensive collection of Islamic art from across the globe, this museum showcases manuscripts, metalwork, ceramics, and textiles. Its exhibits trace the evolution of Islamic art and craftsmanship over centuries.",
    "Location": "cairo",
    "Latitude": 30.0444,
    "Longitude": 31.2572,
    "Type Of Site": "museum",
    "Historical Era": "islamic",
    "Key Features": "['Manuscripts', 'Ceramics', 'Metalwork spanning various Islamic periods']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "120 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Museum of Islamic Art, Description: Housing an extensive collection of Islamic art from across the globe, this museum showcases manuscripts, metalwork, ceramics, and textiles. Its exhibits trace the evolution of Islamic art and craftsmanship over centuries., Location: cairo, Key Features: ['Manuscripts', 'Ceramics', 'Metalwork spanning various Islamic periods'], Historical Era: islamic, Type: museum, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 120 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Museum of Islamic Art.jpeg'"
  },
  {
    "Name": "Saladin Citadel",
    "Description": "Constructed by Sultan Salah ad-Din (Saladin) to protect Cairo from Crusader attacks, this medieval fortification offers striking views over the city. It also houses several historic mosques and museums within its walls.",
    "Location": "cairo",
    "Latitude": 30.0299,
    "Longitude": 31.2617,
    "Type Of Site": "fortress",
    "Historical Era": "islamic",
    "Key Features": "['Strategic defense architecture', 'Panoramic city views', 'Historic mosques within walls']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "200 EGP (foreigners), 40 EGP (Egyptians)",
    "Text": "Name: Saladin Citadel, Description: Constructed by Sultan Salah ad-Din (Saladin) to protect Cairo from Crusader attacks, this medieval fortification offers striking views over the city. It also houses several historic mosques and museums within its walls., Location: cairo, Key Features: ['Strategic defense architecture', 'Panoramic city views', 'Historic mosques within walls'], Historical Era: islamic, Type: fortress, Opening Hours: 09:00 - 17:00, Visit Duration: 2 - 3 hours, Entry Fee: 200 EGP (foreigners), 40 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Saladin Citadel.jpeg'"
  },
  {
    "Name": "Mosque of Muhammad Ali",
    "Description": "Also called the Alabaster Mosque for its gleaming interior walls, this 19th-century Ottoman-style structure was built by Muhammad Ali Pasha. Its prominent dome and twin minarets dominate the skyline of the Citadel.",
    "Location": "cairo",
    "Latitude": 30.0288,
    "Longitude": 31.2615,
    "Type Of Site": "mosque",
    "Historical Era": "islamic",
    "Key Features": "['Ottoman domes and minarets', 'Alabaster interior', 'Iconic city landmark']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "Included with Citadel ticket",
    "Text": "Name: Mosque of Muhammad Ali, Description: Also called the Alabaster Mosque for its gleaming interior walls, this 19th-century Ottoman-style structure was built by Muhammad Ali Pasha. Its prominent dome and twin minarets dominate the skyline of the Citadel., Location: cairo, Key Features: ['Ottoman domes and minarets', 'Alabaster interior', 'Iconic city landmark'], Historical Era: islamic, Type: mosque, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: Included with Citadel ticket",
    "imageUrl": "'assets/images/'Mosque of Muhammad Ali.jpeg'"
  },
  {
    "Name": "Mosque of Ibn Tulun",
    "Description": "Founded by Ahmad ibn Tulun in the 9th century, this mosque is one of Cairo’s oldest and largest. Its distinctive spiral minaret and expansive courtyard exemplify early Islamic architecture in Egypt.",
    "Location": "cairo",
    "Latitude": 30.0245,
    "Longitude": 31.2497,
    "Type Of Site": "mosque",
    "Historical Era": "islamic",
    "Key Features": "['Spiral minaret', 'Large courtyard', 'Historic Islamic architecture']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "60 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Mosque of Ibn Tulun, Description: Founded by Ahmad ibn Tulun in the 9th century, this mosque is one of Cairo’s oldest and largest. Its distinctive spiral minaret and expansive courtyard exemplify early Islamic architecture in Egypt., Location: cairo, Key Features: ['Spiral minaret', 'Large courtyard', 'Historic Islamic architecture'], Historical Era: islamic, Type: mosque, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 60 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Mosque of Ibn Tulun.jpeg'"
  },
  {
    "Name": "Mosque-Madrassa of Sultan Hassan",
    "Description": "A grand 14th-century Mamluk complex noted for its sheer scale, towering walls, and ornate decoration. Its madrassa once taught the four main Sunni schools of jurisprudence, reflecting Cairo's position as an educational center.",
    "Location": "cairo",
    "Latitude": 30.0292,
    "Longitude": 31.2618,
    "Type Of Site": "mosque",
    "Historical Era": "islamic",
    "Key Features": "['Imposing facade', 'Elaborate interiors', 'Attached madrassa (school)']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "80 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Mosque-Madrassa of Sultan Hassan, Description: A grand 14th-century Mamluk complex noted for its sheer scale, towering walls, and ornate decoration. Its madrassa once taught the four main Sunni schools of jurisprudence, reflecting Cairo's position as an educational center., Location: cairo, Key Features: ['Imposing facade', 'Elaborate interiors', 'Attached madrassa (school)'], Historical Era: islamic, Type: mosque, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 80 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Mosque-Madrassa of Sultan Hassan.jpeg'"
  },
  {
    "Name": "Al-Rifa’i Mosque",
    "Description": "Located opposite the Mosque of Sultan Hassan, Al-Rifa’i was completed in the early 20th century. It houses royal tombs and combines traditional Mamluk design with European architectural influences.",
    "Location": "cairo",
    "Latitude": 30.0294,
    "Longitude": 31.2619,
    "Type Of Site": "mosque",
    "Historical Era": "islamic",
    "Key Features": "['Royal tombs', 'Adjacent to Sultan Hassan Mosque', 'Eclectic architectural style']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "80 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Al-Rifa’i Mosque, Description: Located opposite the Mosque of Sultan Hassan, Al-Rifa’i was completed in the early 20th century. It houses royal tombs and combines traditional Mamluk design with European architectural influences., Location: cairo, Key Features: ['Royal tombs', 'Adjacent to Sultan Hassan Mosque', 'Eclectic architectural style'], Historical Era: islamic, Type: mosque, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 80 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Al-Rifa’i Mosque.jpeg'"
  },
  {
    "Name": "The Hanging Church",
    "Description": "Suspended above a Roman fortress gatehouse, this Coptic Orthodox church is dedicated to the Virgin Mary. It showcases beautiful wooden screens and icons, reflecting Egypt’s rich Christian heritage.",
    "Location": "cairo",
    "Latitude": 30.005,
    "Longitude": 31.2299,
    "Type Of Site": "church",
    "Historical Era": "coptic",
    "Key Features": "['Suspended nave', 'Iconic Coptic art', 'Historic pilgrimage site']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "Free",
    "Text": "Name: The Hanging Church, Description: Suspended above a Roman fortress gatehouse, this Coptic Orthodox church is dedicated to the Virgin Mary. It showcases beautiful wooden screens and icons, reflecting Egypt’s rich Christian heritage., Location: cairo, Key Features: ['Suspended nave', 'Iconic Coptic art', 'Historic pilgrimage site'], Historical Era: coptic, Type: church, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: Free",
    "imageUrl": "'assets/images/'The Hanging Church.jpeg'"
  },
  {
    "Name": "Coptic Museum",
    "Description": "Set within the ruins of the Roman fortress of Babylon, the museum houses a significant collection of Coptic artwork and artifacts, including textiles and manuscripts that span centuries of Christian history in Egypt.",
    "Location": "cairo",
    "Latitude": 30.0051,
    "Longitude": 31.2308,
    "Type Of Site": "museum",
    "Historical Era": "coptic",
    "Key Features": "['Wall paintings', 'Textiles', 'Ancient manuscripts']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "100 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Coptic Museum, Description: Set within the ruins of the Roman fortress of Babylon, the museum houses a significant collection of Coptic artwork and artifacts, including textiles and manuscripts that span centuries of Christian history in Egypt., Location: cairo, Key Features: ['Wall paintings', 'Textiles', 'Ancient manuscripts'], Historical Era: coptic, Type: museum, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 100 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Coptic Museum.jpeg'"
  },
  {
    "Name": "Al-Muizz Street",
    "Description": "One of the oldest streets in Cairo, lined with monuments from the Fatimid, Mamluk, and Ottoman periods. Its historic mosques, madrasas, and caravanserais make it a living museum of Islamic architecture.",
    "Location": "cairo",
    "Latitude": 30.0502,
    "Longitude": 31.2611,
    "Type Of Site": "district",
    "Historical Era": "islamic",
    "Key Features": "['Medieval mosques', 'Historic madrasas', 'Traditional souks']",
    "Opening Hours": "Open area (varies by monument)",
    "Typical Visit Duration": "2 - 3 hours (walking)",
    "Entry Fee": "Varies per monument",
    "Text": "Name: Al-Muizz Street, Description: One of the oldest streets in Cairo, lined with monuments from the Fatimid, Mamluk, and Ottoman periods. Its historic mosques, madrasas, and caravanserais make it a living museum of Islamic architecture., Location: cairo, Key Features: ['Medieval mosques', 'Historic madrasas', 'Traditional souks'], Historical Era: islamic, Type: district, Opening Hours: Open area (varies by monument), Visit Duration: 2 - 3 hours (walking), Entry Fee: Varies per monument",
    "imageUrl": "'assets/images/'Al-Muizz Street.jpeg'"
  },
  {
    "Name": "Khan el-Khalili",
    "Description": "A labyrinthine bazaar established in the 14th century, famed for its vibrant shops selling spices, gold, and souvenirs. Its historic coffee houses and narrow alleys provide a glimpse into Cairo’s past.",
    "Location": "cairo",
    "Latitude": 30.0478,
    "Longitude": 31.2622,
    "Type Of Site": "market",
    "Historical Era": "islamic",
    "Key Features": "['Spices, souvenirs', 'Historic cafés', 'Traditional crafts']",
    "Opening Hours": "Most shops 09:00 - 22:00",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "Free",
    "Text": "Name: Khan el-Khalili, Description: A labyrinthine bazaar established in the 14th century, famed for its vibrant shops selling spices, gold, and souvenirs. Its historic coffee houses and narrow alleys provide a glimpse into Cairo’s past., Location: cairo, Key Features: ['Spices, souvenirs', 'Historic cafés', 'Traditional crafts'], Historical Era: islamic, Type: market, Opening Hours: Most shops 09:00 - 22:00, Visit Duration: 2 - 3 hours, Entry Fee: Free",
    "imageUrl": "'assets/images/'Khan el-Khalili.jpeg'"
  },
  {
    "Name": "Bab Zuweila",
    "Description": "A well-preserved medieval gate in the old city walls of Cairo, featuring minarets that can be climbed for a panoramic view. This gate once served as an entry point to the city and was historically used for ceremonial and defensive purposes.",
    "Location": "cairo",
    "Latitude": 30.0404,
    "Longitude": 31.2572,
    "Type Of Site": "monument",
    "Historical Era": "islamic",
    "Key Features": "['Defensive architecture', 'Tower climb', 'City views']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "40 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Bab Zuweila, Description: A well-preserved medieval gate in the old city walls of Cairo, featuring minarets that can be climbed for a panoramic view. This gate once served as an entry point to the city and was historically used for ceremonial and defensive purposes., Location: cairo, Key Features: ['Defensive architecture', 'Tower climb', 'City views'], Historical Era: islamic, Type: monument, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 40 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Bab Zuweila.jpeg'"
  },
  {
    "Name": "Aqsunqur Mosque (Blue Mosque)",
    "Description": "Known for its interior lined with blue Iznik tiles, this 14th-century mosque was later modified under Ottoman influence. Its unique decoration and serene courtyard make it a hidden gem in Islamic Cairo.",
    "Location": "cairo",
    "Latitude": 30.0486,
    "Longitude": 31.2652,
    "Type Of Site": "mosque",
    "Historical Era": "islamic",
    "Key Features": "['Blue Iznik tiles', 'Restored interiors', 'Historic tombs']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "30 - 60 minutes",
    "Entry Fee": "60 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Aqsunqur Mosque (Blue Mosque), Description: Known for its interior lined with blue Iznik tiles, this 14th-century mosque was later modified under Ottoman influence. Its unique decoration and serene courtyard make it a hidden gem in Islamic Cairo., Location: cairo, Key Features: ['Blue Iznik tiles', 'Restored interiors', 'Historic tombs'], Historical Era: islamic, Type: mosque, Opening Hours: 09:00 - 17:00, Visit Duration: 30 - 60 minutes, Entry Fee: 60 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Aqsunqur Mosque (Blue Mosque).jpeg'"
  },
  {
    "Name": "Bayt Al-Suhaymi",
    "Description": "An elegant 17th-century Ottoman-era house that provides an insight into traditional Cairene family life. Its mashrabiyas (wooden lattice screens) and courtyards showcase typical urban residential design of the period.",
    "Location": "cairo",
    "Latitude": 30.0507,
    "Longitude": 31.2625,
    "Type Of Site": "house",
    "Historical Era": "islamic",
    "Key Features": "['Wooden lattice screens', 'Courtyard garden', 'Cairene domestic style']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "60 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Bayt Al-Suhaymi, Description: An elegant 17th-century Ottoman-era house that provides an insight into traditional Cairene family life. Its mashrabiyas (wooden lattice screens) and courtyards showcase typical urban residential design of the period., Location: cairo, Key Features: ['Wooden lattice screens', 'Courtyard garden', 'Cairene domestic style'], Historical Era: islamic, Type: house, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 60 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Bayt Al-Suhaymi.jpeg'"
  },
  {
    "Name": "Mosque of Al-Hakim bi-Amr Allah",
    "Description": "Originally constructed in the 10th century during the Fatimid Caliphate, this mosque has thick fortress-like walls and distinctive minarets. It has undergone multiple restorations over the centuries.",
    "Location": "cairo",
    "Latitude": 30.0545,
    "Longitude": 31.2619,
    "Type Of Site": "mosque",
    "Historical Era": "islamic",
    "Key Features": "['Massive minarets', 'Adjacent to Al-Muizz Street', 'Historic renovations']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "30 - 60 minutes",
    "Entry Fee": "60 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Mosque of Al-Hakim bi-Amr Allah, Description: Originally constructed in the 10th century during the Fatimid Caliphate, this mosque has thick fortress-like walls and distinctive minarets. It has undergone multiple restorations over the centuries., Location: cairo, Key Features: ['Massive minarets', 'Adjacent to Al-Muizz Street', 'Historic renovations'], Historical Era: islamic, Type: mosque, Opening Hours: 09:00 - 17:00, Visit Duration: 30 - 60 minutes, Entry Fee: 60 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Mosque of Al-Hakim bi-Amr Allah.jpeg'"
  },
  {
    "Name": "City of the Dead",
    "Description": "A vast Islamic necropolis in Cairo dating back to the 7th century. Many tombs and mausoleums are still used by local families, creating a unique living community amidst centuries of burial traditions.",
    "Location": "cairo",
    "Latitude": 30.0491,
    "Longitude": 31.2784,
    "Type Of Site": "necropolis",
    "Historical Era": "islamic",
    "Key Features": "['Tombs and mausoleums', 'Residential areas', 'Historic burial traditions']",
    "Opening Hours": "Open area (varies by site)",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "Free or small donations",
    "Text": "Name: City of the Dead, Description: A vast Islamic necropolis in Cairo dating back to the 7th century. Many tombs and mausoleums are still used by local families, creating a unique living community amidst centuries of burial traditions., Location: cairo, Key Features: ['Tombs and mausoleums', 'Residential areas', 'Historic burial traditions'], Historical Era: islamic, Type: necropolis, Opening Hours: Open area (varies by site), Visit Duration: 1 - 2 hours, Entry Fee: Free or small donations",
    "imageUrl": "'assets/images/'City of the Dead.jpeg'"
  },
  {
    "Name": "Gayer-Anderson Museum",
    "Description": "Composed of two adjoining 16th–17th-century houses, this museum was once the residence of a British army officer. It holds a remarkable collection of Islamic furnishings, artwork, and personal curios from around the Middle East.",
    "Location": "cairo",
    "Latitude": 30.0241,
    "Longitude": 31.2495,
    "Type Of Site": "museum",
    "Historical Era": "islamic",
    "Key Features": "['Traditional interiors', 'Eclectic collections', 'Period furnishings']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "60 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Gayer-Anderson Museum, Description: Composed of two adjoining 16th–17th-century houses, this museum was once the residence of a British army officer. It holds a remarkable collection of Islamic furnishings, artwork, and personal curios from around the Middle East., Location: cairo, Key Features: ['Traditional interiors', 'Eclectic collections', 'Period furnishings'], Historical Era: islamic, Type: museum, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 60 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Gayer-Anderson Museum.jpeg'"
  },
  {
    "Name": "Greek Orthodox Church of St. George",
    "Description": "A prominent round church within the Babylon Fortress in Old Cairo. The church’s history spans back to the early Christian period, and it features intricate frescoes and icons of St. George.",
    "Location": "cairo",
    "Latitude": 30.006,
    "Longitude": 31.2296,
    "Type Of Site": "church",
    "Historical Era": "coptic",
    "Key Features": "['Circular nave', 'Historic frescoes', 'Pilgrimage site']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "30 - 60 minutes",
    "Entry Fee": "Free",
    "Text": "Name: Greek Orthodox Church of St. George, Description: A prominent round church within the Babylon Fortress in Old Cairo. The church’s history spans back to the early Christian period, and it features intricate frescoes and icons of St. George., Location: cairo, Key Features: ['Circular nave', 'Historic frescoes', 'Pilgrimage site'], Historical Era: coptic, Type: church, Opening Hours: 09:00 - 17:00, Visit Duration: 30 - 60 minutes, Entry Fee: Free",
    "imageUrl": "'assets/images/'Greek Orthodox Church of St. George.jpeg'"
  },
  {
    "Name": "National Museum of Egyptian Civilization",
    "Description": "A newly built museum that covers Egyptian history from prehistory through modern times in a chronological narrative. It includes the renowned Royal Mummies Hall, showcasing the preserved remains of ancient rulers.",
    "Location": "cairo",
    "Latitude": 29.9864,
    "Longitude": 31.2317,
    "Type Of Site": "museum",
    "Historical Era": "various",
    "Key Features": "['Royal Mummies Hall', 'Chronological exhibits', 'Modern interactive displays']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "2 hours",
    "Entry Fee": "200 EGP (foreigners), 60 EGP (Egyptians)",
    "Text": "Name: National Museum of Egyptian Civilization, Description: A newly built museum that covers Egyptian history from prehistory through modern times in a chronological narrative. It includes the renowned Royal Mummies Hall, showcasing the preserved remains of ancient rulers., Location: cairo, Key Features: ['Royal Mummies Hall', 'Chronological exhibits', 'Modern interactive displays'], Historical Era: various, Type: museum, Opening Hours: 09:00 - 17:00, Visit Duration: 2 hours, Entry Fee: 200 EGP (foreigners), 60 EGP (Egyptians)",
    "imageUrl": "'assets/images/'National Museum of Egyptian Civilization.jpeg'"
  },
  {
    "Name": "Alexandria Catacombs of Kom El Shoqafa",
    "Description": "One of the Seven Wonders of the Middle Ages, these catacombs reflect a fusion of Egyptian, Greek, and Roman styles. A spiral staircase leads visitors through multiple levels of tombs and chambers.",
    "Location": "alexandria",
    "Latitude": 31.1815,
    "Longitude": 29.8964,
    "Type Of Site": "necropolis",
    "Historical Era": "greco-roman",
    "Key Features": "['Hybrid iconography', 'Rock-cut tombs', 'Central spiral staircase']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "100 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Alexandria Catacombs of Kom El Shoqafa, Description: One of the Seven Wonders of the Middle Ages, these catacombs reflect a fusion of Egyptian, Greek, and Roman styles. A spiral staircase leads visitors through multiple levels of tombs and chambers., Location: alexandria, Key Features: ['Hybrid iconography', 'Rock-cut tombs', 'Central spiral staircase'], Historical Era: greco-roman, Type: necropolis, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 100 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Alexandria Catacombs of Kom El Shoqafa.jpeg'"
  },
  {
    "Name": "Pompey’s Pillar",
    "Description": "A 3rd-century Roman triumphal column erected to honor Emperor Diocletian, standing amidst the remnants of Alexandria’s ancient acropolis. It is made of red Aswan granite and stands nearly 30 meters tall.",
    "Location": "alexandria",
    "Latitude": 31.1829,
    "Longitude": 29.8837,
    "Type Of Site": "monument",
    "Historical Era": "greco-roman",
    "Key Features": "['Granite column', 'Historical inscriptions', 'Ancient temple ruins nearby']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "30 - 60 minutes",
    "Entry Fee": "80 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Pompey’s Pillar, Description: A 3rd-century Roman triumphal column erected to honor Emperor Diocletian, standing amidst the remnants of Alexandria’s ancient acropolis. It is made of red Aswan granite and stands nearly 30 meters tall., Location: alexandria, Key Features: ['Granite column', 'Historical inscriptions', 'Ancient temple ruins nearby'], Historical Era: greco-roman, Type: monument, Opening Hours: 09:00 - 17:00, Visit Duration: 30 - 60 minutes, Entry Fee: 80 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Pompey’s Pillar.jpeg'"
  },
  {
    "Name": "Citadel of Qaitbay",
    "Description": "Built in the 15th century by Sultan Al-Ashraf Qaitbay on the eastern side of the harbor, the citadel occupies the site of the legendary Lighthouse of Alexandria. It served as a vital defensive fortress against maritime threats.",
    "Location": "alexandria",
    "Latitude": 31.214,
    "Longitude": 29.8857,
    "Type Of Site": "fortress",
    "Historical Era": "islamic",
    "Key Features": "['Historic harbor fortifications', 'Site of ancient lighthouse', 'Panoramic sea views']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "60 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Citadel of Qaitbay, Description: Built in the 15th century by Sultan Al-Ashraf Qaitbay on the eastern side of the harbor, the citadel occupies the site of the legendary Lighthouse of Alexandria. It served as a vital defensive fortress against maritime threats., Location: alexandria, Key Features: ['Historic harbor fortifications', 'Site of ancient lighthouse', 'Panoramic sea views'], Historical Era: islamic, Type: fortress, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 60 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Citadel of Qaitbay.jpeg'"
  },
  {
    "Name": "Montazah Palace",
    "Description": "Once a summer retreat for Egyptian royalty, the palace complex boasts expansive gardens and scenic vistas of the Mediterranean. Khedive Abbas II commissioned the palace in the late 19th century, blending European and Ottoman architectural elements.",
    "Location": "alexandria",
    "Latitude": 31.2889,
    "Longitude": 30.0006,
    "Type Of Site": "palace",
    "Historical Era": "modern",
    "Key Features": "['Royal architecture', 'Lush gardens', 'Mediterranean shoreline']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "2 hours",
    "Entry Fee": "25 EGP (garden entry), Palace interior varies",
    "Text": "Name: Montazah Palace, Description: Once a summer retreat for Egyptian royalty, the palace complex boasts expansive gardens and scenic vistas of the Mediterranean. Khedive Abbas II commissioned the palace in the late 19th century, blending European and Ottoman architectural elements., Location: alexandria, Key Features: ['Royal architecture', 'Lush gardens', 'Mediterranean shoreline'], Historical Era: modern, Type: palace, Opening Hours: 08:00 - 17:00, Visit Duration: 2 hours, Entry Fee: 25 EGP (garden entry), Palace interior varies",
    "imageUrl": "'assets/images/'Montazah Palace.jpeg'"
  },
  {
    "Name": "Roman Amphitheater",
    "Description": "Constructed in the 2nd century AD, this well-preserved theater once staged musical and dramatic performances. Its design demonstrates Roman engineering prowess, complete with marble seating and remarkable acoustics.",
    "Location": "alexandria",
    "Latitude": 31.1912,
    "Longitude": 29.8972,
    "Type Of Site": "theater",
    "Historical Era": "greco-roman",
    "Key Features": "['Marble seating', 'Acoustic design', 'Adjacent Roman ruins']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "80 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Roman Amphitheater, Description: Constructed in the 2nd century AD, this well-preserved theater once staged musical and dramatic performances. Its design demonstrates Roman engineering prowess, complete with marble seating and remarkable acoustics., Location: alexandria, Key Features: ['Marble seating', 'Acoustic design', 'Adjacent Roman ruins'], Historical Era: greco-roman, Type: theater, Opening Hours: 09:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 80 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Roman Amphitheater.jpeg'"
  },
  {
    "Name": "Alexandria National Museum",
    "Description": "Housed in a renovated Italian-style mansion, the museum narrates the story of Alexandria through Pharaonic, Greco-Roman, Coptic, and Islamic exhibits. Underwater archaeological finds highlight the city’s link to the sea.",
    "Location": "alexandria",
    "Latitude": 31.2065,
    "Longitude": 29.9092,
    "Type Of Site": "museum",
    "Historical Era": "various",
    "Key Features": "['Synchronized timeline', 'Underwater discoveries', 'Renovated Italianate mansion']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "100 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Alexandria National Museum, Description: Housed in a renovated Italian-style mansion, the museum narrates the story of Alexandria through Pharaonic, Greco-Roman, Coptic, and Islamic exhibits. Underwater archaeological finds highlight the city’s link to the sea., Location: alexandria, Key Features: ['Synchronized timeline', 'Underwater discoveries', 'Renovated Italianate mansion'], Historical Era: various, Type: museum, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 100 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Alexandria National Museum.jpeg'"
  },
  {
    "Name": "Luxor Temple",
    "Description": "Erected largely by Amenhotep III and Ramses II, Luxor Temple was dedicated to the rejuvenation of kingship. Its location in the heart of modern Luxor, connected to Karnak by the Avenue of Sphinxes, underscores its central religious importance.",
    "Location": "luxor",
    "Latitude": 25.6998,
    "Longitude": 32.6397,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Avenue of Sphinxes', 'Grand pylons', 'Colossal statues']",
    "Opening Hours": "06:00 - 22:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Luxor Temple, Description: Erected largely by Amenhotep III and Ramses II, Luxor Temple was dedicated to the rejuvenation of kingship. Its location in the heart of modern Luxor, connected to Karnak by the Avenue of Sphinxes, underscores its central religious importance., Location: luxor, Key Features: ['Avenue of Sphinxes', 'Grand pylons', 'Colossal statues'], Historical Era: pharaonic, Type: temple, Opening Hours: 06:00 - 22:00, Visit Duration: 1 - 2 hours, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Luxor Temple.jpeg'"
  },
  {
    "Name": "Karnak Temple Complex",
    "Description": "Spanning multiple reigns from the Middle to the New Kingdom, Karnak is the largest ancient religious complex in Egypt. Its Great Hypostyle Hall, with 134 gigantic columns, is among the most impressive architectural achievements of antiquity.",
    "Location": "luxor",
    "Latitude": 25.7188,
    "Longitude": 32.6573,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Hypostyle Hall with giant columns', 'Sacred lake', 'Multiple chapels and pylons']",
    "Opening Hours": "06:00 - 17:30",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "200 EGP (foreigners), 40 EGP (Egyptians)",
    "Text": "Name: Karnak Temple Complex, Description: Spanning multiple reigns from the Middle to the New Kingdom, Karnak is the largest ancient religious complex in Egypt. Its Great Hypostyle Hall, with 134 gigantic columns, is among the most impressive architectural achievements of antiquity., Location: luxor, Key Features: ['Hypostyle Hall with giant columns', 'Sacred lake', 'Multiple chapels and pylons'], Historical Era: pharaonic, Type: temple, Opening Hours: 06:00 - 17:30, Visit Duration: 2 - 3 hours, Entry Fee: 200 EGP (foreigners), 40 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Karnak Temple Complex.jpeg'"
  },
  {
    "Name": "Luxor Museum",
    "Description": "Opened in 1975, this museum highlights artifacts discovered in the Theban region, ranging from the Old Kingdom to the Mamluk period. Its carefully curated displays include statues, jewelry, and well-preserved mummies.",
    "Location": "luxor",
    "Latitude": 25.7042,
    "Longitude": 32.6487,
    "Type Of Site": "museum",
    "Historical Era": "pharaonic",
    "Key Features": "['Theban artifacts', 'Well-preserved statues', 'Rotating special exhibitions']",
    "Opening Hours": "09:00 - 16:00, 17:00 - 21:00 (varies seasonally)",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "160 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Luxor Museum, Description: Opened in 1975, this museum highlights artifacts discovered in the Theban region, ranging from the Old Kingdom to the Mamluk period. Its carefully curated displays include statues, jewelry, and well-preserved mummies., Location: luxor, Key Features: ['Theban artifacts', 'Well-preserved statues', 'Rotating special exhibitions'], Historical Era: pharaonic, Type: museum, Opening Hours: 09:00 - 16:00, 17:00 - 21:00 (varies seasonally), Visit Duration: 1 - 2 hours, Entry Fee: 160 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Luxor Museum.jpeg'"
  },
  {
    "Name": "Valley of the Kings",
    "Description": "An iconic royal burial ground where many New Kingdom pharaohs, including Tutankhamun and Ramses the Great, were interred. Each tomb reveals elaborate decorations and texts designed to guide the deceased to the afterlife.",
    "Location": "luxor",
    "Latitude": 25.7402,
    "Longitude": 32.6014,
    "Type Of Site": "necropolis",
    "Historical Era": "pharaonic",
    "Key Features": "['Tomb of Tutankhamun', 'In-depth wall paintings', 'Dozens of royal tombs']",
    "Opening Hours": "06:00 - 17:00",
    "Typical Visit Duration": "2 - 3 hours",
    "Entry Fee": "240 EGP (foreigners), 40 EGP (Egyptians) for standard tombs",
    "Text": "Name: Valley of the Kings, Description: An iconic royal burial ground where many New Kingdom pharaohs, including Tutankhamun and Ramses the Great, were interred. Each tomb reveals elaborate decorations and texts designed to guide the deceased to the afterlife., Location: luxor, Key Features: ['Tomb of Tutankhamun', 'In-depth wall paintings', 'Dozens of royal tombs'], Historical Era: pharaonic, Type: necropolis, Opening Hours: 06:00 - 17:00, Visit Duration: 2 - 3 hours, Entry Fee: 240 EGP (foreigners), 40 EGP (Egyptians) for standard tombs",
    "imageUrl": "'assets/images/'Valley of the Kings.jpeg'"
  },
  {
    "Name": "Valley of the Queens",
    "Description": "Reserved for the queens and royal children of the New Kingdom, this valley contains the exquisitely decorated tomb of Queen Nefertari. The vivid paintings inside these tombs provide insights into royal life and funerary beliefs.",
    "Location": "luxor",
    "Latitude": 25.7246,
    "Longitude": 32.59,
    "Type Of Site": "necropolis",
    "Historical Era": "pharaonic",
    "Key Features": "['Tomb of Nefertari', 'Painted reliefs', 'Smaller-scale tombs']",
    "Opening Hours": "06:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "100 EGP (foreigners), 20 EGP (Egyptians), Extra for Nefertari's tomb",
    "Text": "Name: Valley of the Queens, Description: Reserved for the queens and royal children of the New Kingdom, this valley contains the exquisitely decorated tomb of Queen Nefertari. The vivid paintings inside these tombs provide insights into royal life and funerary beliefs., Location: luxor, Key Features: ['Tomb of Nefertari', 'Painted reliefs', 'Smaller-scale tombs'], Historical Era: pharaonic, Type: necropolis, Opening Hours: 06:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 100 EGP (foreigners), 20 EGP (Egyptians), Extra for Nefertari's tomb",
    "imageUrl": "'assets/images/'Valley of the Queens.jpeg'"
  },
  {
    "Name": "Temple of Hatshepsut at Deir el-Bahari",
    "Description": "Commissioned by Queen Hatshepsut, one of Egypt’s few female pharaohs, this terraced mortuary temple nestles against towering limestone cliffs. Its reliefs commemorate trade expeditions and divine birth myths.",
    "Location": "luxor",
    "Latitude": 25.7379,
    "Longitude": 32.6065,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Terraced structure', 'Colonnaded courts', 'Depictions of Hatshepsut’s reign']",
    "Opening Hours": "06:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Temple of Hatshepsut at Deir el-Bahari, Description: Commissioned by Queen Hatshepsut, one of Egypt’s few female pharaohs, this terraced mortuary temple nestles against towering limestone cliffs. Its reliefs commemorate trade expeditions and divine birth myths., Location: luxor, Key Features: ['Terraced structure', 'Colonnaded courts', 'Depictions of Hatshepsut’s reign'], Historical Era: pharaonic, Type: temple, Opening Hours: 06:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Temple of Hatshepsut at Deir el-Bahari.jpeg'"
  },
  {
    "Name": "Medinet Habu",
    "Description": "Dedicated to Ramses III, Medinet Habu is admired for its well-preserved reliefs portraying battles, religious ceremonies, and daily rituals. It ranks among the most significant temples on Luxor’s West Bank.",
    "Location": "luxor",
    "Latitude": 25.725,
    "Longitude": 32.6022,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Detailed reliefs', 'Massive pylons', 'Inner sanctuaries']",
    "Opening Hours": "06:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "100 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Medinet Habu, Description: Dedicated to Ramses III, Medinet Habu is admired for its well-preserved reliefs portraying battles, religious ceremonies, and daily rituals. It ranks among the most significant temples on Luxor’s West Bank., Location: luxor, Key Features: ['Detailed reliefs', 'Massive pylons', 'Inner sanctuaries'], Historical Era: pharaonic, Type: temple, Opening Hours: 06:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 100 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Medinet Habu.jpeg'"
  },
  {
    "Name": "Ramesseum",
    "Description": "The mortuary temple of Ramses II, called the ‘Million-Year House,’ features colossal fallen statues once standing over 17 meters high. Its walls bear inscriptions of the Pharaoh’s campaigns, most famously the Battle of Kadesh.",
    "Location": "luxor",
    "Latitude": 25.7333,
    "Longitude": 32.595,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Colossal Ramses II statues', 'Famous Ozymandias reference', 'Intricate wall scenes']",
    "Opening Hours": "06:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "80 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Ramesseum, Description: The mortuary temple of Ramses II, called the ‘Million-Year House,’ features colossal fallen statues once standing over 17 meters high. Its walls bear inscriptions of the Pharaoh’s campaigns, most famously the Battle of Kadesh., Location: luxor, Key Features: ['Colossal Ramses II statues', 'Famous Ozymandias reference', 'Intricate wall scenes'], Historical Era: pharaonic, Type: temple, Opening Hours: 06:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 80 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Ramesseum.jpeg'"
  },
  {
    "Name": "Deir el-Medina",
    "Description": "A unique settlement that housed the artisans and laborers who built the royal tombs in the nearby valleys. The workers’ tombs here are themselves intricately decorated, providing valuable insight into non-royal life in ancient Egypt.",
    "Location": "luxor",
    "Latitude": 25.7332,
    "Longitude": 32.6047,
    "Type Of Site": "archaeological site",
    "Historical Era": "pharaonic",
    "Key Features": "['Artisan tombs', 'Residential ruins', 'Insight into daily life of tomb builders']",
    "Opening Hours": "06:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "100 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Deir el-Medina, Description: A unique settlement that housed the artisans and laborers who built the royal tombs in the nearby valleys. The workers’ tombs here are themselves intricately decorated, providing valuable insight into non-royal life in ancient Egypt., Location: luxor, Key Features: ['Artisan tombs', 'Residential ruins', 'Insight into daily life of tomb builders'], Historical Era: pharaonic, Type: archaeological site, Opening Hours: 06:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 100 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Deir el-Medina.jpeg'"
  },
  {
    "Name": "Temple of Seti I (Abydos)",
    "Description": "Famed for the Abydos King List, which catalogs dynastic lineage, this temple was built by Seti I and his son Ramses II. Its well-preserved reliefs rank among the finest examples of New Kingdom art.",
    "Location": "abydos",
    "Latitude": 26.1862,
    "Longitude": 31.9193,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Abydos King List', 'Exquisite reliefs', 'Dedicated to multiple gods']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Temple of Seti I (Abydos), Description: Famed for the Abydos King List, which catalogs dynastic lineage, this temple was built by Seti I and his son Ramses II. Its well-preserved reliefs rank among the finest examples of New Kingdom art., Location: abydos, Key Features: ['Abydos King List', 'Exquisite reliefs', 'Dedicated to multiple gods'], Historical Era: pharaonic, Type: temple, Opening Hours: 08:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Temple of Seti I (Abydos).jpeg'"
  },
  {
    "Name": "Temple of Ramses II (Abydos)",
    "Description": "Standing near the Temple of Seti I, this site celebrates Ramses II’s military victories and divine lineage. Its decorative motifs showcase the Pharaonic power and piety characteristic of his extensive reign.",
    "Location": "abydos",
    "Latitude": 26.1855,
    "Longitude": 31.9189,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Richly painted walls', 'Depictions of military victories', 'Shared complex with Seti I’s temple']",
    "Opening Hours": "08:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians) (combined with Seti I)",
    "Text": "Name: Temple of Ramses II (Abydos), Description: Standing near the Temple of Seti I, this site celebrates Ramses II’s military victories and divine lineage. Its decorative motifs showcase the Pharaonic power and piety characteristic of his extensive reign., Location: abydos, Key Features: ['Richly painted walls', 'Depictions of military victories', 'Shared complex with Seti I’s temple'], Historical Era: pharaonic, Type: temple, Opening Hours: 08:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians) (combined with Seti I)",
    "imageUrl": "'assets/images/'Temple of Ramses II (Abydos).jpeg'"
  },
  {
    "Name": "Temple of Dendera",
    "Description": "Dedicated to the goddess Hathor, Dendera’s richly ornamented columns and astronomical ceiling highlight Greco-Roman religious syncretism. Visitors can explore underground crypts and see vibrant painted hieroglyphs throughout.",
    "Location": "qena",
    "Latitude": 26.1645,
    "Longitude": 32.6558,
    "Type Of Site": "temple",
    "Historical Era": "greco-roman",
    "Key Features": "['Ceiling zodiac', 'Crypt chambers', 'Elaborate Hathor carvings']",
    "Opening Hours": "07:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Temple of Dendera, Description: Dedicated to the goddess Hathor, Dendera’s richly ornamented columns and astronomical ceiling highlight Greco-Roman religious syncretism. Visitors can explore underground crypts and see vibrant painted hieroglyphs throughout., Location: qena, Key Features: ['Ceiling zodiac', 'Crypt chambers', 'Elaborate Hathor carvings'], Historical Era: greco-roman, Type: temple, Opening Hours: 07:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Temple of Dendera.jpeg'"
  },
  {
    "Name": "Temple of Horus at Edfu",
    "Description": "One of Egypt’s most intact temples, built during the Ptolemaic period, dedicated to the falcon god Horus. Massive pylons flank the entrance, and the inner walls recount the divine birth and victories of Horus.",
    "Location": "edfu",
    "Latitude": 24.9792,
    "Longitude": 32.8746,
    "Type Of Site": "temple",
    "Historical Era": "greco-roman",
    "Key Features": "['Massive pylons', 'Sacred barque shrine', 'Mythological reliefs']",
    "Opening Hours": "07:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "180 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Temple of Horus at Edfu, Description: One of Egypt’s most intact temples, built during the Ptolemaic period, dedicated to the falcon god Horus. Massive pylons flank the entrance, and the inner walls recount the divine birth and victories of Horus., Location: edfu, Key Features: ['Massive pylons', 'Sacred barque shrine', 'Mythological reliefs'], Historical Era: greco-roman, Type: temple, Opening Hours: 07:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 180 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Temple of Horus at Edfu.jpeg'"
  },
  {
    "Name": "Temple of Kom Ombo",
    "Description": "A dual temple overlooking the Nile, Kom Ombo venerates both Sobek (the crocodile god) and Horus the Elder. Its symmetrical design includes twin entrances and sanctuaries, symbolizing the duality of worship within one complex.",
    "Location": "aswan",
    "Latitude": 24.4663,
    "Longitude": 32.9462,
    "Type Of Site": "temple",
    "Historical Era": "greco-roman",
    "Key Features": "['Twin sanctuaries', 'Crocodile Museum nearby', 'Nile River panorama']",
    "Opening Hours": "07:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Temple of Kom Ombo, Description: A dual temple overlooking the Nile, Kom Ombo venerates both Sobek (the crocodile god) and Horus the Elder. Its symmetrical design includes twin entrances and sanctuaries, symbolizing the duality of worship within one complex., Location: aswan, Key Features: ['Twin sanctuaries', 'Crocodile Museum nearby', 'Nile River panorama'], Historical Era: greco-roman, Type: temple, Opening Hours: 07:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Temple of Kom Ombo.jpeg'"
  },
  {
    "Name": "Philae Temple",
    "Description": "An island complex honoring the goddess Isis, Philae was carefully relocated to Agilkia Island to save it from flooding caused by the Aswan High Dam. The temple’s reliefs depict legends of Isis, Osiris, and Horus.",
    "Location": "aswan",
    "Latitude": 24.0243,
    "Longitude": 32.884,
    "Type Of Site": "temple",
    "Historical Era": "greco-roman",
    "Key Features": "['Island setting', 'Temple of Isis', 'Sound-and-light shows']",
    "Opening Hours": "07:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "180 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Philae Temple, Description: An island complex honoring the goddess Isis, Philae was carefully relocated to Agilkia Island to save it from flooding caused by the Aswan High Dam. The temple’s reliefs depict legends of Isis, Osiris, and Horus., Location: aswan, Key Features: ['Island setting', 'Temple of Isis', 'Sound-and-light shows'], Historical Era: greco-roman, Type: temple, Opening Hours: 07:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 180 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Philae Temple.jpeg'"
  },
  {
    "Name": "Unfinished Obelisk",
    "Description": "Discovered in the granite quarries of Aswan, this massive obelisk was abandoned due to cracks that formed during its carving. It demonstrates the advanced stone-cutting techniques of ancient Egypt.",
    "Location": "aswan",
    "Latitude": 24.0083,
    "Longitude": 32.8789,
    "Type Of Site": "archaeological site",
    "Historical Era": "pharaonic",
    "Key Features": "['Granite quarry', 'Cracked obelisk', 'Insight into obelisk carving']",
    "Opening Hours": "07:00 - 17:00",
    "Typical Visit Duration": "30 - 60 minutes",
    "Entry Fee": "80 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Unfinished Obelisk, Description: Discovered in the granite quarries of Aswan, this massive obelisk was abandoned due to cracks that formed during its carving. It demonstrates the advanced stone-cutting techniques of ancient Egypt., Location: aswan, Key Features: ['Granite quarry', 'Cracked obelisk', 'Insight into obelisk carving'], Historical Era: pharaonic, Type: archaeological site, Opening Hours: 07:00 - 17:00, Visit Duration: 30 - 60 minutes, Entry Fee: 80 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Unfinished Obelisk.jpeg'"
  },
  {
    "Name": "Tombs of the Nobles",
    "Description": "These cliffside tombs in Aswan belonged to high officials, governors, and nobles, offering detailed paintings of daily life, religious rituals, and genealogical lists. Visitors can admire broad views of the Nile from the hillside.",
    "Location": "aswan",
    "Latitude": 24.0886,
    "Longitude": 32.8875,
    "Type Of Site": "necropolis",
    "Historical Era": "pharaonic",
    "Key Features": "['Colorful scenes of daily life', 'Strategic hillside location', 'Overlooks Aswan and Nile']",
    "Opening Hours": "07:00 - 17:00",
    "Typical Visit Duration": "1 hour",
    "Entry Fee": "60 EGP (foreigners), 10 EGP (Egyptians)",
    "Text": "Name: Tombs of the Nobles, Description: These cliffside tombs in Aswan belonged to high officials, governors, and nobles, offering detailed paintings of daily life, religious rituals, and genealogical lists. Visitors can admire broad views of the Nile from the hillside., Location: aswan, Key Features: ['Colorful scenes of daily life', 'Strategic hillside location', 'Overlooks Aswan and Nile'], Historical Era: pharaonic, Type: necropolis, Opening Hours: 07:00 - 17:00, Visit Duration: 1 hour, Entry Fee: 60 EGP (foreigners), 10 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Tombs of the Nobles.jpeg'"
  },
  {
    "Name": "Elephantine Island",
    "Description": "Historically marking Egypt’s southern boundary, this island contains archaeological ruins of the Temple of Khnum and a traditional Nubian village. It also features a Nilometer used to measure the river’s water levels.",
    "Location": "aswan",
    "Latitude": 24.0863,
    "Longitude": 32.887,
    "Type Of Site": "archaeological site",
    "Historical Era": "various",
    "Key Features": "['Temple of Khnum ruins', 'Nubian culture', 'Nilometer structures']",
    "Opening Hours": "Open area (museum sites 09:00 - 17:00)",
    "Typical Visit Duration": "2 - 3 hours (exploring entire island)",
    "Entry Fee": "Varies by site on the island",
    "Text": "Name: Elephantine Island, Description: Historically marking Egypt’s southern boundary, this island contains archaeological ruins of the Temple of Khnum and a traditional Nubian village. It also features a Nilometer used to measure the river’s water levels., Location: aswan, Key Features: ['Temple of Khnum ruins', 'Nubian culture', 'Nilometer structures'], Historical Era: various, Type: archaeological site, Opening Hours: Open area (museum sites 09:00 - 17:00), Visit Duration: 2 - 3 hours (exploring entire island), Entry Fee: Varies by site on the island",
    "imageUrl": "'assets/images/'Elephantine Island.jpeg'"
  },
  {
    "Name": "Nubian Museum",
    "Description": "Established to preserve the history and culture of Nubia, the museum includes artifacts salvaged before the creation of Lake Nasser. Exhibits cover prehistoric times, the Pharaonic era, and modern Nubian life.",
    "Location": "aswan",
    "Latitude": 24.0802,
    "Longitude": 32.8886,
    "Type Of Site": "museum",
    "Historical Era": "various",
    "Key Features": "['Nubian heritage', 'Ethnographic displays', 'Outdoor exhibit areas']",
    "Opening Hours": "09:00 - 17:00",
    "Typical Visit Duration": "1 - 2 hours",
    "Entry Fee": "140 EGP (foreigners), 20 EGP (Egyptians)",
    "Text": "Name: Nubian Museum, Description: Established to preserve the history and culture of Nubia, the museum includes artifacts salvaged before the creation of Lake Nasser. Exhibits cover prehistoric times, the Pharaonic era, and modern Nubian life., Location: aswan, Key Features: ['Nubian heritage', 'Ethnographic displays', 'Outdoor exhibit areas'], Historical Era: various, Type: museum, Opening Hours: 09:00 - 17:00, Visit Duration: 1 - 2 hours, Entry Fee: 140 EGP (foreigners), 20 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Nubian Museum.jpeg'"
  },
  {
    "Name": "Abu Simbel Temples",
    "Description": "Two towering rock-cut temples commissioned by Ramses II, featuring four colossal statues of the pharaoh seated at the entrance. The temples were famously relocated in the 1960s to protect them from the rising waters of Lake Nasser.",
    "Location": "aswan",
    "Latitude": 22.3373,
    "Longitude": 31.6258,
    "Type Of Site": "temple",
    "Historical Era": "pharaonic",
    "Key Features": "['Colossal seated statues of Ramses II', 'Sun alignment phenomenon', 'Temple of Queen Nefertari']",
    "Opening Hours": "05:00 - 17:00",
    "Typical Visit Duration": "2 hours",
    "Entry Fee": "240 EGP (foreigners), 30 EGP (Egyptians)",
    "Text": "Name: Abu Simbel Temples, Description: Two towering rock-cut temples commissioned by Ramses II, featuring four colossal statues of the pharaoh seated at the entrance. The temples were famously relocated in the 1960s to protect them from the rising waters of Lake Nasser., Location: aswan, Key Features: ['Colossal seated statues of Ramses II', 'Sun alignment phenomenon', 'Temple of Queen Nefertari'], Historical Era: pharaonic, Type: temple, Opening Hours: 05:00 - 17:00, Visit Duration: 2 hours, Entry Fee: 240 EGP (foreigners), 30 EGP (Egyptians)",
    "imageUrl": "'assets/images/'Abu Simbel Temples.jpeg'"
  }
]